Функция getUserGET(Запрос)
	
	Логин = Строка(Запрос.ПараметрыЗапроса.Получить("username"));
	
	ЗапросПользователя = Новый Запрос;
	
	Если Логин <> "" Тогда
		ЗапросПользователя.Текст =
		"ВЫБРАТЬ
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Пользователи.Ссылка) КАК Ссылка,
		|	Пользователи.Наименование КАК Наименование,
		|	Пользователи.Код КАК Код
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	НЕ Пользователи.ПометкаУдаления
		|	И Пользователи.Наименование = &Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
		
		ЗапросПользователя.УстановитьПараметр("Наименование", Логин);
	Иначе
		ЗапросПользователя.Текст =
		"ВЫБРАТЬ
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Пользователи.Ссылка) КАК Ссылка,
		|	Пользователи.Наименование КАК Наименование,
		|	Пользователи.Код КАК Код
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	НЕ Пользователи.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование" 
	КонецЕсли;
	
	РезультатЗапрос = ЗапросПользователя.Выполнить();
	
	МассивПользователей = Новый Массив;
	
	Выборка = РезультатЗапрос.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеПользователя = Новый Структура;
		ДанныеПользователя.Вставить("guid", Строка(Выборка.Ссылка)); 
		ДанныеПользователя.Вставить("name", Строка(Выборка.Наименование));
		ДанныеПользователя.Вставить("code", Строка(Выборка.Код));
		
		МассивПользователей.Добавить(ДанныеПользователя);
	КонецЦикла;
	
	Ответ = Новый  HTTPСервисОтвет(200);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, МассивПользователей);
	СтрокаОтвета = ЗаписьJSON.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(СтрокаОтвета);
	
	Возврат Ответ;
	
КонецФункции

Функция regUserGET(Запрос)
	
	Логин = Строка(Запрос.ПараметрыЗапроса.Получить("username"));
	
	Телефон = Строка(Запрос.ПараметрыЗапроса.Получить("telephone")); 
	
    НовыйПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
	НовыйПользовательИБ.Имя = Логин;
	НовыйПользовательИБ.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
	НовыйПользовательИБ.Записать();
		
	НовыйКлиент = Справочники.Контрагенты.СоздатьЭлемент();
	НовыйКлиент.Наименование = Логин;
	НовыйКлиент.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиент;
	НовыйКлиент.КонтактныйТелефон = Телефон; 
	НовыйКлиент.Комментарий = "Контрагент зарегистрирован через мобильное приложение"; 
	НовыйКлиент.Записать();
	
	НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
	НовыйПользователь.Код = НовыйПользовательИБ.УникальныйИдентификатор;
	НовыйПользователь.Наименование = Логин;
	НовыйПользователь.Клиент = НовыйКлиент.Ссылка;
	НовыйПользователь.Записать(); 	
	
	ЗапросПользователя = Новый Запрос;
	
	ЗапросПользователя.Текст =
	"ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Пользователи.Ссылка) КАК Ссылка,
	|	Пользователи.Наименование КАК Наименование,
	|	Пользователи.Код КАК Код
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	НЕ Пользователи.ПометкаУдаления
	|	И Пользователи.Наименование = &Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	ЗапросПользователя.УстановитьПараметр("Наименование", Логин);
	
	РезультатЗапрос = ЗапросПользователя.Выполнить();
	
	МассивПользователей = Новый Массив;
	
	Выборка = РезультатЗапрос.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеПользователя = Новый Структура;
		ДанныеПользователя.Вставить("guid", Строка(Выборка.Ссылка)); 
		ДанныеПользователя.Вставить("name", Строка(Выборка.Наименование));
		ДанныеПользователя.Вставить("code", Строка(Выборка.Код));
		
		МассивПользователей.Добавить(ДанныеПользователя);
	КонецЦикла;
	
	Ответ = Новый  HTTPСервисОтвет(200);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, МассивПользователей);
	СтрокаОтвета = ЗаписьJSON.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(СтрокаОтвета);
	
	Возврат Ответ;
	
КонецФункции
