&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерерасчетСуммыДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьИтоговуюСуммуТовара()
	
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
	
	РаботаСтабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
	
	ПерерасчетСуммыДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьИтоговуюСуммуУслуг()
	
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	
	РаботаСтабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
	
	ПерерасчетСуммыДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	РасчитатьИтоговуюСуммуТовара();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	РасчитатьИтоговуюСуммуТовара();
	
КонецПроцедуры  

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	РасчитатьИтоговуюСуммуУслуг();
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	РасчитатьИтоговуюСуммуУслуг();
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	
	СтрокаТЧ.СтатьяЗатрат = РаботаСНоменклатуройВызовСервер.ОпределитьСтатьяЗапрат(СтрокаТЧ.Услуга);		
		
	
КонецПроцедуры








