&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	Если Объект.Контрагент.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Покупатель") Тогда
		Элементы.Договор.Видимость = Истина;
	Иначе
		Элементы.Договор.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьСуммаДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма") + Объект.Абонементы.Итог("Стоимость");
	
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьИтогТовар()
	
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
	
	РаботаСтабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
	
	РасчитатьСуммаДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьИтогУслуга()
	
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	
	РаботаСтабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
	
	РасчитатьСуммаДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
		СтрокаТЧ.Цена = РаботаСЦенамиВызовСервера.ПолучитьЦенуНаДату(СтрокаТЧ.Номенклатура,,Объект.Дата);
	Иначе
		СтрокаТЧ.Цена = 0
	КонецЕсли;
	
	РасчитатьИтогТовар();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	РасчитатьИтогТовар();
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(СтрокаТЧ.Услуга) Тогда
		СтрокаТЧ.Цена = РаботаСЦенамиВызовСервера.ПолучитьЦенуНаДату(СтрокаТЧ.Услуга,,Объект.Дата);
	Иначе
		СтрокаТЧ.Цена = 0;
	КонецЕсли;
	
	РасчитатьИтогУслуга();
	
КонецПроцедуры  

&НаКлиенте
Процедура АбонементыНоменклатураПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.Абонементы.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
		СтрокаТЧ.Стоимость = РаботаСЦенамиВызовСервера.ПолучитьЦенуНаДату(СтрокаТЧ.Номенклатура,,Объект.Дата);
		СтрокаТЧ.КоличествоМесяцев = РаботаСНоменклатуройВызовСервер.КоличествоМесяцевАб(СтрокаТЧ.Номенклатура);
	Иначе
		СтрокаТЧ.Стоимость = 0;
		СтрокаТЧ.КоличествоМесяцев = 0;
	КонецЕсли;
	
	РасчитатьСуммаДокумента();	
	
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	РасчитатьИтогУслуга();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьАбонементыНаСервере()
	
	Для каждого ТекСтрокаАбонемент ИЗ Объект.Абонементы Цикл
		Абонемент = Справочники.Абонементы.СоздатьЭлемент();
		Абонемент.Номенклатура = ТекСтрокаАбонемент.Номенклатура;
		Абонемент.Владелец = Объект.Контрагент;
		Абонемент.Наименование =  Абонемент.Владелец.Наименование + " (" + Абонемент.Номенклатура.Наименование + ")";
		Абонемент.Владелец = Объект.Контрагент;
		Абонемент.Менеджер = Объект.Сотрудник;
		Абонемент.ДатаПродажи = Объект.Дата;
		Абонемент.ДокументПродажи = Объект.Ссылка;
		Если ТекСтрокаАбонемент.Активировать = Истина Тогда
			Абонемент.ДатаАктивации = Объект.Дата;
			Абонемент.ДатаОкончания = ДобавитьМесяц(Абонемент.ДатаАктивации,Абонемент.СрокДействия);
		Иначе
			Абонемент.ДатаАктивации = Неопределено;
			Абонемент.ДатаОкончания = Неопределено;
		КонецЕсли;
		Абонемент.СрокДействия = ТекСтрокаАбонемент.КоличествоМесяцев;
		Абонемент.ДнейЗаморозки = РаботаСНоменклатуройВызовСервер.КоличествоЗамарозки(ТекСтрокаАбонемент.Номенклатура);
		Абонемент.ОстатокДнейЗаморозки = РаботаСНоменклатуройВызовСервер.КоличествоЗамарозки(ТекСтрокаАбонемент.Номенклатура);	
		Абонемент.Записать();
		ТекСтрокаАбонемент.Абонемент = Документы.Реализация.ПолучитСсылкуАбонемент(Объект.Ссылка);
	КонецЦикла; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьАбонементы(Команда)
	
	Если Объект.Ссылка.Пустая() ИЛИ ЭтаФорма.Модифицированность Тогда 
		ТекстВопроса = "Для выполнения команды ""Создать абонементы"" данные будут записаны?
		| Записать и продолжить";
		
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОСозданииАбонемента", ЭтаФорма);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,"Внимание!");
		
	Иначе
		СоздатьАбонементыНаСервере();
		ЭтаФорма.Записать();
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеОтветаНаВопросОСозданииАбонемента(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СоздатьАбонементыНаСервере();
		ЭтаФорма.Записать();
	КонецЕсли;
	
КонецПроцедуры



	