&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(СтрокаТЧ.Услуга) Тогда
		СтрокаТЧ.Цена = РаботаСЦенамиВызовСервера.ПолучитьЦенуНаДату(СтрокаТЧ.Услуга,,Объект.Дата);
	Иначе
		СтрокаТЧ.Цена = 0;
	КонецЕсли;
	
	РасчетИтогСуммуТЧ();
		
КонецПроцедуры 

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент) 
	
	РасчетИтогСуммуТЧ();
	
КонецПроцедуры

&НаКлиенте
Процедура АбонементыАбонементПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.Абонементы.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(СтрокаТЧ.Абонемент) Тогда
		СтрокаТЧ.Стоимость = РаботаСЦенамиВызовСервера.ПолучитьЦенуНаДату(СтрокаТЧ.Абонемент,,Объект.Дата);
		СтрокаТЧ.КоличествоМесяцев = РаботаСНоменклатуройВызовСервер.КоличествоМесяцевАб(СтрокаТЧ.Абонемент);
	Иначе
		СтрокаТЧ.Стоимость = 0;
	КонецЕсли;
	
	РасчетСуммуДокумена();
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетИтогСуммуТЧ()
	
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	
	РаботаСтабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
	
	РасчетСуммуДокумена();
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетСуммуДокумена()
	
	Объект.СуммаДокумента = Объект.Услуги.Итог("Сумма") + Объект.Абонементы.Итог("Стоимость");
	
КонецПроцедуры



