&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ДлинаЭлементаИНН()
	
	Если Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ИндивидуальныйПредприниматель") Тогда
		Элементы.ИНН.ОграничениеТипа =  Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(12));			
	Иначе
		Элементы.ИНН.ОграничениеТипа = Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(10)); 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаСтрДлиныИНН()
	
	Если Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ИндивидуальныйПредприниматель") И СтрДлина(Объект.ИНН) = 12 Тогда
		ОчиститьСообщения();
	ИначеЕсли Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо") И СтрДлина(Объект.ИНН) = 10 Тогда
		ОчиститьСообщения();
	Иначе
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = СтрШаблон("Неверно введен ИНН!");
		СообщениеПользователю.Сообщить(); 
	КонецЕсли;
	
	
КонецПроцедуры  

&НаКлиенте
Процедура УстановитьДоступностьЭлементов()
	
	Если Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо") Тогда
		Элементы.ГлавныйБухгалтер.Видимость = Истина;
	Иначе
		Элементы.ГлавныйБухгалтер.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОрганизацииПриИзменении(Элемент)
	
	ДлинаЭлементаИНН();
	Объект.ИНН = Неопределено;
	
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	
	ПроверкаСтрДлиныИНН();	
	
КонецПроцедуры

