Функция ПроверитьОказаниеУслуг(ДокументЗК) Экспорт
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ДокументОснование", ДокументЗК);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реализация.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Реализация КАК Реализация
	|ГДЕ
	|	Реализация.ДокументОснование = &ДокументОснование
	|	И Реализация.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	Реализация.Ссылка";
	
	Рез = Запрос.Выполнить();
	Если НЕ Рез.Пустой() Тогда
		УслугаОказана = Истина;
	КонецЕсли;
	Возврат УслугаОказана;
КонецФункции

