&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		СформироватьНаименованиеАбонимента();
	КонецЕсли;
	
	РасчитатьОкончаниеАбонимента();
	
	ПерерасчетДнейЗаморозки();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименованиеАбонимента()
	
	Если ЗначениеЗаполнено(Объект.Владелец) И ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Объект.Наименование = Элементы.Владелец.ВыделенныйТекст + " (" + Элементы.Номенклатура.ВыделенныйТекст + ")";
	ИначеЕсли ЗначениеЗаполнено(Объект.Владелец) И НЕ ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Объект.Наименование = Элементы.Владелец.ВыделенныйТекст + "( )";
	Иначе
		Объект.Наименование = "(" + Элементы.Номенклатура.ВыделенныйТекст + ")";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьОкончаниеАбонимента()
	
	Объект.ДатаОкончания  = ДобавитьМесяц(Объект.ДатаАктивации,Объект.СрокДействия) + (Объект.Заморозки.Итог("ДнейЗаморозки") * 86400);
	
КонецПроцедуры  

&НаКлиенте
Процедура ПерерасчетДнейЗаморозки()
	
	Объект.ОстатокДнейЗаморозки = Объект.ДнейЗаморозки - Объект.Заморозки.Итог("ДнейЗаморозки");
	
КонецПроцедуры 

&НаКлиенте
Процедура РасчитатьДнейЗаморозкиТЧ()
	
	СтрокаТЧ = Элементы.Заморозки.ТекущиеДанные;		
	СтрокаТЧ.ДнейЗаморозки = (СтрокаТЧ.ДатаОкончания  - СтрокаТЧ.ДатаНачала) / 86400;
	
	Если СтрокаТЧ.ДнейЗаморозки > Объект.ОстатокДнейЗаморозки Тогда
		СтрокаТЧ.ДатаОкончания = СтрокаТЧ.ДатаНачала + (Объект.ОстатокДнейЗаморозки * 86400);
		СтрокаТЧ.ДнейЗаморозки = (СтрокаТЧ.ДатаОкончания  - СтрокаТЧ.ДатаНачала) / 86400;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаАктивацииПриИзменении(Элемент)
	
	РасчитатьОкончаниеАбонимента()
	
КонецПроцедуры

&НаКлиенте
Процедура СрокДействияПриИзменении(Элемент)
	
	РасчитатьОкончаниеАбонимента();
	
КонецПроцедуры

&НаКлиенте
Процедура ДнейЗаморозкиПриИзменении(Элемент)    
	
	Объект.ОстатокДнейЗаморозки = Объект.ДнейЗаморозки;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаморозкиДатаНачалаПриИзменении(Элемент)
	
	РасчитатьДнейЗаморозкиТЧ();	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаморозкиДатаОкончанияПриИзменении(Элемент)
	
	РасчитатьДнейЗаморозкиТЧ();
	
	РасчитатьОкончаниеАбонимента();
	
	ПерерасчетДнейЗаморозки();
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	СформироватьНаименованиеАбонимента();	
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	СформироватьНаименованиеАбонимента();
	
КонецПроцедуры


